# Advance Functionality

In [ ]:
# .shift() .rank() .rolling() .cumsum()

In [1]:
import pandas as pd

coffee = pd.read_csv("../warmup-data/coffee.csv")
coffee['Price'] = coffee['Coffee Type'].apply(lambda x: 3.55 if x == 'Espresso' else 5.99)
coffee['Revenue'] = coffee['Units Sold'] * coffee['Price']

In [ ]:
# start with .shift()

coffee['yesterday_rev'] = coffee['Revenue'].shift(2)
coffee['per_change'] = coffee['Revenue'] / coffee['yesterday_rev'] * 100
coffee

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_rev,per_change
0,Monday,Espresso,25,3.55,88.75,NaN,NaN
1,Monday,Latte,15,5.99,89.85,NaN,NaN
2,Tuesday,Espresso,30,3.55,106.50,88.75,120.000000
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333
4,Wednesday,Espresso,35,3.55,124.25,106.50,116.666667
5,Wednesday,Latte,25,5.99,149.75,119.80,125.000000
6,Thursday,Espresso,40,3.55,142.00,124.25,114.285714
7,Thursday,Latte,30,5.99,179.70,149.75,120.000000
8,Friday,Espresso,45,3.55,159.75,142.00,112.500000
9,Friday,Latte,35,5.99,209.65,179.70,116.666667
10,Saturday,Espresso,45,3.55,159.75,159.75,100.000000
11,Saturday,Latte,35,5.99,209.65,209.65,100.000000
12,Sunday,Espresso,45,3.55,159.75,159.75,100.000000
13,Sunday,Latte,35,5.99,209.65,209.65,100.000000

In [ ]:
bios = pd.read_csv('../data/bios.csv')

# .rank()

bios['height_rank'] = bios['height_cm'].rank()
bios.sort_values(['height_rank'],ascending=False)[['name','height_cm']]

                         name  height_cm
89070                Yao Ming      226.0
6978          Arvydas Sabonis      223.0
5781           Tommy Burleson      223.0
89075          Roberto Dueñas      221.0
120266           Zhang Zhaoxu      221.0
...                       ...        ...
145490            Sin Ye-Chan        NaN
145491          Matthew Wepke        NaN
145492  Carlos García-Ordóñez        NaN
145493     Landysh Falyakhova        NaN
145499          Bill Phillips        NaN

[145500 rows x 2 columns]

In [ ]:
# .cumsum()

coffee['cumulative_rev'] = coffee['Revenue'].cumsum()
coffee

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_rev,per_change,cumulative_rev
0,Monday,Espresso,25,3.55,88.75,NaN,NaN,88.75
1,Monday,Latte,15,5.99,89.85,NaN,NaN,178.60
2,Tuesday,Espresso,30,3.55,106.50,88.75,120.000000,285.10
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333,404.90
4,Wednesday,Espresso,35,3.55,124.25,106.50,116.666667,529.15
5,Wednesday,Latte,25,5.99,149.75,119.80,125.000000,678.90
6,Thursday,Espresso,40,3.55,142.00,124.25,114.285714,820.90
7,Thursday,Latte,30,5.99,179.70,149.75,120.000000,1000.60
8,Friday,Espresso,45,3.55,159.75,142.00,112.500000,1160.35
9,Friday,Latte,35,5.99,209.65,179.70,116.666667,1370.00
10,Saturday,Espresso,45,3.55,159.75,159.75,100.000000,1529.75
11,Saturday,Latte,35,5.99,209.65,209.65,100.000000,1739.40
12,Sunday,Espresso,45,3.55,159.75,159.75,100.000000,1899.15
13,Sunday,Latte,35,5.99,209.65,209.65,100.000000,2108.80

In [17]:
# .rolling()

latte = coffee[coffee['Coffee Type'] == "Latte"].copy()

latte['3day'] = latte['Revenue'].rolling(3).sum()
latte

,Day,Coffee Type,Units Sold,Price,Revenue,yesterday_rev,per_change,cumulative_rev,3day
1,Monday,Latte,15,5.99,89.85,NaN,NaN,178.6,NaN
3,Tuesday,Latte,20,5.99,119.80,89.85,133.333333,404.9,NaN
5,Wednesday,Latte,25,5.99,149.75,119.80,125.000000,678.9,359.40
7,Thursday,Latte,30,5.99,179.70,149.75,120.000000,1000.6,449.25
9,Friday,Latte,35,5.99,209.65,179.70,116.666667,1370.0,539.10
11,Saturday,Latte,35,5.99,209.65,209.65,100.000000,1739.4,599.00
13,Sunday,Latte,35,5.99,209.65,209.65,100.000000,2108.8,628.95